a = ['wh',10,8,9.5]
b = ['qhy',9,7,9]
c = ['zzy',9,6,8]
print(a[0:1],"总分",sum(a[1:]))
print(b[0:1],"总分",sum(b[1:]))
print(c[0:1],"总分",sum(c[1:]))
print("全班总和：",sum(a[1:])+sum(b[1:])+sum(c[1:]))
print("班级第1门最高分",max(a[1:2]+b[1:2]+c[1:2]))
print("班级第2门最高分",max(a[2:3]+b[2:3]+c[2:3]))
print("班级第3门最高分",max(a[3:]+b[3:]+c[3:]))
print("班级第1门最低分",min(a[1:2]+b[1:2]+c[1:2]))
print("班级第2门最低分",min(a[2:3]+b[2:3]+c[2:3]))
print("班级第3门最低分",min(a[3:]+b[3:]+c[3:]))
print("全班平均分",'%.2f'%(sum(a[1:]+b[1:]+c[1:])/3))
print("班级第1门平均分",'%.2f'%(sum(a[1:2]+b[1:2]+c[1:2])/3))
print("班级第2门平均分",'%.2f'%(sum(a[2:3]+b[2:3]+c[2:3])/3))
print("班级第3门平均分",'%.2f'%(sum(a[3:]+b[3:]+c[3:])/3))
